# ****** коментарий ******

# Ctrl + / = открытие однострочного комментария 

"""
qwerty
многострочный 
комментарий 
qwerty """

#  a = 10
#  b = 20


# ***** встроенные фцнкции ввода и вывода *****

# вызов функции печати в терминал (print)
# print("Привет, 'миp'")
 
# PEP8

# 
# вызов функции ввода из терминала (input)
# print(input("пустота: "))

# ***** переменные *****

my_var = 100 # целое чилсло - объект 
myVar = 200

# операция сложения 
r = my_var + myVar

# print 

# **** типы данных ****
# простые типы 

int_num = 1000 # целое число (integer, int )

floatNum = 3.14 # числа с плавающей точкой (вещественные числа) (float)

my_str = "привет, мир!" # строеи (строково1 тип данны ) (string, str)

boolean = True #Fales - булевы значния (boolean, bool

# print(int_num * 2) 

# print(int_num * floatNum)

result = my_str * 3 # умножение строк

result = my_str + " " + 'Python' #конкатинация 

# print(result)
 
# ***** способ форматирваная строк f-string (f-строка) *****

name = "john"
age = 25 

s = f"My name is {name}. Age: {age}."

# print(s)

# ***** Арифметические операции *****

x = 10
y = 3.5

res_1 = x + y

res_2 = x * y

res_3 = x / y # обычное деление 

res_4 = x // y # целочисленное деление 

res_5 = x % y # деление по остатку 

res_6 = x ** y # возведение в степень 

import math # импортирование модуля 

rec_7 = math.sqrt(100) # извлечение квадратного корня 

# print(rec_7)


# ***** логические операции *****

x = 2
y = 5

res_1 = x !=2 # оператор "не равно" 

res_2 = x == y # оператор "равно"

res_3 = x > y # оператор "больше"

res_4 = x < y # оператор "меньше"

res_5 = x >= y # оператор "больше(меньше) или равно"

print(res_5)

